#appdirs-1.4.4 pyyaml-6.0.2 unicodecsv-0.14.1 unihan-etl-0.37.0 zhon-2.1.1
#cihai-0.35.0 greenlet-3.2.3 mypy-1.17.0 mypy_extensions-1.1.0 pathspec-0.12.1 sqlalchemy-2.0.41 tomli-2.2.1

CONSTANTS = ('㗎', '𠻹', '吔', '唧', '哋', '靚', '咦', '啲', '嗱', '唉',
    '𡁵', '𠸏', '嘞', '哦', '咁', '𠻺', '吖', '嚹', '喀',
    '喎', '囖', '喇', '𡃉', '誒', '噉', '咗', '啫', '咩', 
    '呃', '乜', '嘢', '噉', '咁', '埋', '嚟',
    '一', '乙', '二', '十', '丁', '刁', '匕', '厂', '七', '卜', '八', '人', '入', '儿', '几', '九', '了', '刀', '力', '乃', '又', '乜', '三', '干', '于', '工', '土', '士', '才', '下', '寸', '大', '丈', '与', '万', '兀', '上', '口', '山', '巾', '千', '川', '夕', '久', '么', '凡', '丸', '及', '广', '亡', '门', '丫', '义', '之', '尸', '己', '弓', '子', '卫', '也', '女', '刃', '飞', '习', '叉', '马', '乡', '孑', '幺', '丰', '王', '开', '井', '天', '夫', '无', '云', '专', '丐', '木', '五', '犬', '太', '歹', '尤', '车', '巨', '牙', '屯', '戈', '互', '瓦', '韦', '廿', '卅', '止', '少', '曰', '日', '中', '贝', '内', '水', '见', '午', '牛', '手', '气', '毛', '壬', '升', '夭', '长', '片', '斤', '爪', '父', '月', '氏', '勿', '丹', '乌', '六', '文', '方', '火', '为', '斗', '户', '心', '尺', '丑', '巴', '办', '予', '书', '尹', '毋', '玉', '未', '末', '击', '正', '甘', '世', '本', '术', '丙', '石', '戊', '龙', '平', '东', '卡', '凸', '业', '目', '且', '甲', '申', '电', '田', '由', '史', '央', '冉', '皿', '凹', '四', '生', '矢', '失', '乍', '禾', '丘', '白', '斥', '瓜', '乎', '用', '甩', '乐', '匆', '册', '鸟', '氐', '主', '立', '半', '头', '必', '永', '民', '弗', '出', '矛', '母', '耳', '亚', '臣', '吏', '再', '西', '百', '而', '页', '夹', '夷', '耒', '虫', '曲', '肉', '曳', '年', '朱', '臼', '自', '血', '囟', '舟', '亦', '衣', '产', '亥', '羊', '米', '州', '农', '聿', '艮', '严', '求', '甫', '更', '束', '两', '酉', '卤', '里', '串', '芈', '身', '囱', '言', '羌', '弟', '事', '雨', '果', '垂', '秉', '臾', '肃', '隶', '承', '革', '柬', '面', '禺', '重', '鬼', '禹', '首', '兼', '象', '鼠', '的', '小', '没', '穿', '不', '请', '对', '条', '们', '些', '拿', '在', '那', '哇', '他', '给', '吗', '你', '我', '是', '有', '会', '好', '就', '都', '呢', '啊', '个', '呀')
CONSTANT_ID_MAP = {
    ch: 215 + i
    for i, ch in enumerate(CONSTANTS)
}

class Radicals:
    def __init__(self, character, radical_id):
        if character:
            self.radical_id = CONSTANT_ID_MAP.get(character, radical_id)
        else:
            self.radical_id = 0
